package ch02;

public class c04자료형 {

	public static void main(String[] args) {
		//------------------원시타입(c언어로 부터 물려 받음, 기본 자료형===선 공간 형성-------------------------------
		//byte (1byte) / 음수양수
		//short (2byte) / 음수양수
		// char(2byte)  / 양수값만 지원		
				//----> 숫자나 문자나 모두 2진수로 담아낼 수 있지만 단일 문자는 양수값만 지원하는 char 로 담아낸다 --> 이유는 아스키코드에서는 양수만 쓰기 때문에
		
		// int (4byte) / 기본 /음수양수
		//long (8byte) / 음수양수
		//float(4byte 실수)
		//double(8byte - 기본 실수)  실수 값은 연산하면 문제가 많이 발생하기 때문에 올림해서 정수로 쓰는 것이 기본임
		
		// char(2byte)
		
		//-----------------------------------------------------------------------------------------------
		
		
		//String(클래스 자료형) 동적공간 할당---들어가려는 데이터에 따라 공간이 형성됨!
	}

}
